<a href="https://colab.research.google.com/github/tamkench95/Deep-river/blob/main/Untitled10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [9]:
df=pd.read_csv('/content/drive/MyDrive/pydata-book-2nd-edition/pydata-book-2nd-edition/examples/ex1.csv')

In [10]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
list(open('/content/drive/MyDrive/pydata-book-2nd-edition/pydata-book-2nd-edition/examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [17]:
import sys
df.to_csv(sys.stdout)

,a,b,c,d,message
0,1,2,3,4,hello
1,5,6,7,8,world
2,9,10,11,12,foo

In [15]:
!pwd

/content

In [20]:
df.to_csv('myout.csv')

In [18]:
!ls

drive  myout.csv  sample_data

In [19]:
!cat -n myout.csv

     1	,a,b,c,d,message
     2	0,1,2,3,4,hello
     3	1,5,6,7,8,world
     4	2,9,10,11,12,foo

In [24]:
d1 =pd.DataFrame({'name': ['이순신', '황진이', '깽둥어', '강감찬'],
                 'job': ['공무원', '가수', '물고기', '공무원']})

d2 =pd.DataFrame({'p_name': ['이순신', '황진이', '깽둥어', '강감찬'],
                 'project': ['A', 'A', 'B', 'C']})

In [25]:
d1

  name  job
0  이순신  공무원
1  황진이   가수
2  깽둥어  물고기
3  강감찬  공무원

In [26]:
d2

  p_name project
0    이순신       A
1    황진이       A
2    깽둥어       B
3    강감찬       C

In [27]:
pd.merge(d1, d2, left_on ='name', right_on = 'p_name').drop('name', axis=1)

   job p_name project
0  공무원    이순신       A
1   가수    황진이       A
2  물고기    깽둥어       B
3  공무원    강감찬       C

In [28]:
print(d1,'\n\n',d2)

  name  job
0  이순신  공무원
1  황진이   가수
2  깽둥어  물고기
3  강감찬  공무원

   p_name project
0    이순신       A
1    황진이       A
2    깽둥어       B
3    강감찬       C